Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: ونراه قريبا
en: But We see it [as] near.

source: يوم تكون السماء كالمهل
en: On the Day the sky will be like murky oil,

source: وتكون الجبال كالعهن
en: And the mountains will be like wool,

source: ولا يسأل حميم حميما
en: And no friend will ask [anything of] a friend,

source: يبصرونهم يود المجرم لو يفتدي من عذاب يومئذ ببنيه
en: They will be shown each other. The criminal will wish that he could be ransomed from the punishment of that Day by his children

source: وصاحبته وأخيه
en: And his wife and his brother

source: وفصيلته التي تؤويه
en: And his nearest kindred who shelter him

source: ومن في الأرض جميعا ثم ينجيه
en: And whoever is on earth entirely [so] then it could save him.

source: كلا إنها لظى
en: No! Indeed, it is the Flame [of Hell],

source: نزاعة للشوى
en: A remover of exteriors.

source: تدعو من أدبر وتولى
en: It invites he who turned his back [on truth] and went away [from obedience]

source: وجمع فأوعى
en: And collected [wealth] and hoarded.

source: إن الإنسان خلق هلوعا
en: Indeed, mankind was created anxious:

source: إذا مسه الشر جزوعا
en: When evil touches him, impatient,

source: وإذا مسه الخير منوعا
en: And when good touches him, withholding [of it],

source: إلا المصلين
en: Except the observers of prayer -

source: الذين هم على صلاتهم دائمون
en: Those who are constant in their prayer

source: والذين في أموالهم حق معلوم
en: And those within whose wealth is a known right

source: للسائل والمحروم
en: For the petitioner and the deprived -

source: والذين يصدقون بيوم الدين
en: And those who believe in the Day of Recompense

source: والذين هم من عذاب ربهم مشفقون
en: And those who are fearful of the punishment of their Lord -

source: إن عذاب ربهم غير مأمون
en: Indeed, the punishment of their Lord is not that from which one is safe -

source: والذين هم بشهاداتهم قائمون
en: And those who are in their testimonies upright

source: والذين هم على صلاتهم يحافظون
en: And those who [carefully] maintain their prayer:

source: أولئك في جنات مكرمون
en: They will be in gardens, honored.

source: فمال الذين كفروا قبلك مهطعين
en: So what is [the matter] with those who disbelieve, hastening [from] before you, [O Muhammad],

source: عن اليمين وعن الشمال عزين
en: [To sit] on [your] right and [your] left in separate groups?

source: أيطمع كل امرئ منهم أن يدخل جنة نعيم
en: Does every person among them aspire to enter a garden of pleasure?

source: كلا إنا خلقناهم مما يعلمون
en: No! Indeed, We have created them from that which they know.

source: فلا أقسم برب المشارق والمغارب إنا لقادرون
en: So I swear by the Lord of [all] risings and settings that indeed We are able

source: على أن نبدل خيرا منهم وما نحن بمسبوقين
en: To replace them with better than them; and We are not to be outdone.

source: يوم يخرجون من الأجداث سراعا كأنهم إلى نصب يوفضون
en: The Day they will emerge from the graves rapidly as if they were, toward an erected idol, hastening.

source: خاشعة أبصارهم ترهقهم ذلة ذلك اليوم الذي كانوا يوعدون
en: Their eyes humbled, humiliation will cover them. That is the Day which they had been promised.

source: إنا أرسلنا نوحا إلى قومه أن أنذر قومك من قبل أن يأتيهم عذاب أليم
en: Indeed, We sent Noah to his people, [saying], "Warn your people before there comes to them a painful punishment."

source: قال يا قوم إني لكم نذير مبين
en: He said, "O my people, indeed I am to you a clear warner,

source: أن اعبدوا الله واتقوه وأطيعون
en: [Saying], 'Worship Allah, fear Him and obey me.

source: يغفر لكم من ذنوبكم ويؤخركم إلى أجل مسمى إن أجل الله إذا جاء لا يؤخر لو كنتم تعلمون
en: Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' "

source: قال رب إني دعوت قومي ليلا ونهارا
en: He said, "My Lord, indeed I invited my people [to truth] night and day.

source: فلم يزدهم دعائي إلا فرارا
en: But my invitation increased them not except in flight.

source: وإني كلما دعوتهم لتغفر لهم جعلوا أصابعهم في آذانهم واستغشوا ثيابهم وأصروا واستكبروا استكبارا
en: And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.

source: ثم إني دعوتهم جهارا
en: Then I invited them publicly.

source: ثم إني أعلنت لهم وأسررت لهم إسرارا
en: Then I announced to them and [also] confided to them secretly

source: فقلت استغفروا ربكم إنه كان غفارا
en: And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.

source: يرسل السماء عليكم مدرارا
en: He will send [rain from] the sky upon you in [continuing] showers

source: ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهارا
en: And give you increase in wealth and children and provide for you gardens and provide for you rivers.

source: ما لكم لا ترجون لله وقارا
en: What is [the matter] with you that you do not attribute to Allah [due] grandeur

source: وقد خلقكم أطوارا
en: While He has created you in stages?

source: ألم تروا كيف خلق الله سبع سماوات طباقا
en: Do you not consider how Allah has created seven heavens in layers

source: وجعل القمر فيهن نورا وجعل الشمس سراجا
en: And made the moon therein a [reflected] light and made the sun a burning lamp?

source: والله أنبتكم من الأرض نباتا
en: And Allah has caused you to grow from the earth a [progressive] growth.

source: ثم يعيدكم فيها ويخرجكم إخراجا
en: Then He will return you into it and extract you [another] extraction.

source: والله جعل لكم الأرض بساطا
en: And Allah has made for you the earth an expanse

source: لتسلكوا منها سبلا فجاجا
en: That you may follow therein roads of passage.' "

source: قال نوح رب إنهم عصوني واتبعوا من لم يزده ماله وولده إلا خسارا
en: Noah said, "My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.

source: ومكروا مكرا كبارا
en: And they conspired an immense conspiracy.

source: وقالوا لا تذرن آلهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا
en: And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.

source: وقد أضلوا كثيرا ولا تزد الظالمين إلا ضلالا
en: And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error."

source: مما خطيئاتهم أغرقوا فأدخلوا نارا فلم يجدوا لهم من دون الله أنصارا
en: Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.

source: وقال نوح رب لا تذر على الأرض من الكافرين ديارا
en: And Noah said, "My Lord, do not leave upon the earth from among the disbelievers an inhabitant.

source: إنك إن تذرهم يضلوا عبادك ولا يلدوا إلا فاجرا كفارا
en: Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.

source: رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تبارا
en: My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction."

source: قل أوحي إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنا عجبا
en: Say, [O Muhammad], "It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an.

source: يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا
en: It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone.

source: وأنه تعالى جد ربنا ما اتخذ صاحبة ولا ولدا
en: And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son

source: وأنه كان يقول سفيهنا على الله شططا
en: And that our foolish one has been saying about Allah an excessive transgression.

source: وأنا ظننا أن لن تقول الإنس والجن على الله كذبا
en: And we had thought that mankind and the jinn would never speak about Allah a lie.

source: وأنه كان رجال من الإنس يعوذون برجال من الجن فزادوهم رهقا
en: And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden.

source: وأنهم ظنوا كما ظننتم أن لن يبعث الله أحدا
en: And they had thought, as you thought, that Allah would never send anyone [as a messenger].

source: وأنا لمسنا السماء فوجدناها ملئت حرسا شديدا وشهبا
en: And we have sought [to reach] the heaven but found it filled with powerful guards and burning flames.

source: وأنا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهابا رصدا
en: And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him.

source: وأنا لا ندري أشر أريد بمن في الأرض أم أراد بهم ربهم رشدا
en: And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.

source: وأنا منا الصالحون ومنا دون ذلك كنا طرائق قددا
en: And among us are the righteous, and among us are [others] not so; we were [of] divided ways.

source: وأنا ظننا أن لن نعجز الله في الأرض ولن نعجزه هربا
en: And we have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight.

source: وأنا لما سمعنا الهدى آمنا به فمن يؤمن بربه فلا يخاف بخسا ولا رهقا
en: And when we heard the guidance, we believed in it. And whoever believes in his Lord will not fear deprivation or burden.

source: وأنا منا المسلمون ومنا القاسطون فمن أسلم فأولئك تحروا رشدا
en: And among us are Muslims [in submission to Allah], and among us are the unjust. And whoever has become Muslim - those have sought out the right course.

source: وأما القاسطون فكانوا لجهنم حطبا
en: But as for the unjust, they will be, for Hell, firewood.'

source: وأن لو استقاموا على الطريقة لأسقيناهم ماء غدقا
en: And [Allah revealed] that if they had remained straight on the way, We would have given them abundant provision

source: لنفتنهم فيه ومن يعرض عن ذكر ربه يسلكه عذابا صعدا
en: So We might test them therein. And whoever turns away from the remembrance of his Lord He will put into arduous punishment.

source: وأن المساجد لله فلا تدعوا مع الله أحدا
en: And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone.

source: وأنه لما قام عبد الله يدعوه كادوا يكونون عليه لبدا
en: And that when the Servant of Allah stood up supplicating Him, they almost became about him a compacted mass."

source: قل إنما أدعو ربي ولا أشرك به أحدا
en: Say, [O Muhammad], "I only invoke my Lord and do not associate with Him anyone."

source: قل إني لا أملك لكم ضرا ولا رشدا
en: Say, "Indeed, I do not possess for you [the power of] harm or right direction."

source: قل إني لن يجيرني من الله أحد ولن أجد من دونه ملتحدا
en: Say, "Indeed, there will never protect me from Allah anyone [if I should disobey], nor will I find in other than Him a refuge.

source: إلا بلاغا من الله ورسالاته ومن يعص الله ورسوله فإن له نار جهنم خالدين فيها أبدا
en: But [I have for you] only notification from Allah, and His messages." And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever.

source: حتى إذا رأوا ما يوعدون فسيعلمون من أضعف ناصرا وأقل عددا
en: [The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number.

source: قل إن أدري أقريب ما توعدون أم يجعل له ربي أمدا
en: Say, "I do not know if what you are promised is near or if my Lord will grant for it a [long] period."

source: عالم الغيب فلا يظهر على غيبه أحدا
en: [He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone

source: إلا من ارتضى من رسول فإنه يسلك من بين يديه ومن خلفه رصدا
en: Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers

source: ليعلم أن قد أبلغوا رسالات ربهم وأحاط بما لديهم وأحصى كل شيء عددا
en: That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number.

source: يا أيها المزمل
en: O you who wraps himself [in clothing],

source: قم الليل إلا قليلا
en: Arise [to pray] the night, except for a little -

source: نصفه أو انقص منه قليلا
en: Half of it - or subtract from it a little

source: أو زد عليه ورتل القرآن ترتيلا
en: Or add to it, and recite the Qur'an with measured recitation.

source: إنا سنلقي عليك قولا ثقيلا
en: Indeed, We will cast upon you a heavy word.

source: إن ناشئة الليل هي أشد وطئا وأقوم قيلا
en: Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.

source: إن لك في النهار سبحا طويلا
en: Indeed, for you by day is prolonged occupation.

source: واذكر اسم ربك وتبتل إليه تبتيلا
en: And remember the name of your Lord and devote yourself to Him with [complete] devotion.

source: رب المشرق والمغرب لا إله إلا هو فاتخذه وكيلا
en: [He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.

source: واصبر على ما يقولون واهجرهم هجرا جميلا
en: And be patient over what they say and avoid them with gracious avoidance.

source: وذرني والمكذبين أولي النعمة ومهلهم قليلا
en: And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.

source: إن لدينا أنكالا وجحيما
en: Indeed, with Us [for them] are shackles and burning fire

source: وطعاما ذا غصة وعذابا أليما
en: And food that chokes and a painful punishment -

source: يوم ترجف الأرض والجبال وكانت الجبال كثيبا مهيلا
en: On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.

source: إنا أرسلنا إليكم رسولا شاهدا عليكم كما أرسلنا إلى فرعون رسولا
en: Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.

source: فعصى فرعون الرسول فأخذناه أخذا وبيلا
en: But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.

source: فكيف تتقون إن كفرتم يوما يجعل الولدان شيبا
en: Then how can you fear, if you disbelieve, a Day that will make the children white- haired?

source: السماء منفطر به كان وعده مفعولا
en: The heaven will break apart therefrom; ever is His promise fulfilled.

source: إن هذه تذكرة فمن شاء اتخذ إلى ربه سبيلا
en: Indeed, this is a reminder, so whoever wills may take to his Lord a way.

source: إن ربك يعلم أنك تقوم أدنى من ثلثي الليل ونصفه وثلثه وطائفة من الذين معك والله يقدر الليل والنهار علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن علم أن سيكون منكم مرضى وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله فاقرءوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضا حسنا وما تقدموا لأنفسكم من خير تجدوه عند الله هو خيرا وأعظم أجرا واستغفروا الله إن الله غفور رحيم
en: Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.

source: يا أيها المدثر
en: O you who covers himself [with a garment],

source: قم فأنذر
en: Arise and warn

source: وربك فكبر
en: And your Lord glorify

source: وثيابك فطهر
en: And your clothing purify

source: والرجز فاهجر
en: And uncleanliness avoid

source: ولا تمنن تستكثر
en: And do not confer favor to acquire more

source: ولربك فاصبر
en: But for your Lord be patient.

source: فإذا نقر في الناقور
en: And when the trumpet is blown,

source: فذلك يومئذ يوم عسير
en: That Day will be a difficult day

source: على الكافرين غير يسير
en: For the disbelievers - not easy.

source: ذرني ومن خلقت وحيدا
en: Leave Me with the one I created alone

source: وجعلت له مالا ممدودا
en: And to whom I granted extensive wealth

source: وبنين شهودا
en: And children present [with him]

source: ومهدت له تمهيدا
en: And spread [everything] before him, easing [his life].

source: ثم يطمع أن أزيد
en: Then he desires that I should add more.

source: كلا إنه كان لآياتنا عنيدا
en: No! Indeed, he has been toward Our verses obstinate.

source: سأرهقه صعودا
en: I will cover him with arduous torment.

source: إنه فكر وقدر
en: Indeed, he thought and deliberated.

source: فقتل كيف قدر
en: So may he be destroyed [for] how he deliberated.

source: ثم قتل كيف قدر
en: Then may he be destroyed [for] how he deliberated.

source: ثم نظر
en: Then he considered [again];

source: ثم عبس وبسر
en: Then he frowned and scowled;

source: ثم أدبر واستكبر
en: Then he turned back and was arrogant

source: فقال إن هذا إلا سحر يؤثر
en: And said, "This is not but magic imitated [from others].

source: إن هذا إلا قول البشر
en: This is not but the word of a human being."

source: سأصليه سقر
en: I will drive him into Saqar.

source: وما أدراك ما سقر
en: And what can make you know what is Saqar?

source: لا تبقي ولا تذر
en: It lets nothing remain and leaves nothing [unburned],

source: لواحة للبشر
en: Blackening the skins.

source: عليها تسعة عشر
en: Over it are nineteen [angels].

source: وما جعلنا أصحاب النار إلا ملائكة وما جعلنا عدتهم إلا فتنة للذين كفروا ليستيقن الذين أوتوا الكتاب ويزداد الذين آمنوا إيمانا ولا يرتاب الذين أوتوا الكتاب والمؤمنون وليقول الذين في قلوبهم مرض والكافرون ماذا أراد الله بهذا مثلا كذلك يضل الله من يشاء ويهدي من يشاء وما يعلم جنود ربك إلا هو وما هي إلا ذكرى للبشر
en: And We have not made the keepers of the Fire except angels. And We have not made their number except as a trial for those who disbelieve - that those who were given the Scripture will be convinced and those who have believed will increase in faith and those who were given the Scripture and the believers will not doubt and that those in whose hearts is hypocrisy and the disbelievers will say, "What does Allah intend by this as an example?" Thus does Allah leave astray whom He wills and guides whom He wills. And none knows the soldiers of your Lord except Him. And mention of the Fire is not but a reminder to humanity.

source: كلا والقمر
en: No! By the moon

source: والليل إذ أدبر
en: And [by] the night when it departs

source: والصبح إذا أسفر
en: And [by] the morning when it brightens,

source: إنها لإحدى الكبر
en: Indeed, the Fire is of the greatest [afflictions]

source: نذيرا للبشر
en: As a warning to humanity -

source: لمن شاء منكم أن يتقدم أو يتأخر
en: To whoever wills among you to proceed or stay behind.

source: كل نفس بما كسبت رهينة
en: Every soul, for what it has earned, will be retained

source: إلا أصحاب اليمين
en: Except the companions of the right,

source: في جنات يتساءلون
en: [Who will be] in gardens, questioning each other

source: عن المجرمين
en: About the criminals,

source: ما سلككم في سقر
en: [And asking them], "What put you into Saqar?"

source: قالوا لم نك من المصلين
en: They will say, "We were not of those who prayed,

source: ولم نك نطعم المسكين
en: Nor did we used to feed the poor.

source: وكنا نخوض مع الخائضين
en: And we used to enter into vain discourse with those who engaged [in it],

source: وكنا نكذب بيوم الدين
en: And we used to deny the Day of Recompense

source: حتى أتانا اليقين
en: Until there came to us the certainty."

source: فما تنفعهم شفاعة الشافعين
en: So there will not benefit them the intercession of [any] intercessors.

source: فما لهم عن التذكرة معرضين
en: Then what is [the matter] with them that they are, from the reminder, turning away

source: كأنهم حمر مستنفرة
en: As if they were alarmed donkeys

source: فرت من قسورة
en: Fleeing from a lion?

source: بل يريد كل امرئ منهم أن يؤتى صحفا منشرة
en: Rather, every person among them desires that he would be given scriptures spread about.

source: كلا بل لا يخافون الآخرة
en: No! But they do not fear the Hereafter.

source: كلا إنه تذكرة
en: No! Indeed, the Qur'an is a reminder

source: فمن شاء ذكره
en: Then whoever wills will remember it.

source: وما يذكرون إلا أن يشاء الله هو أهل التقوى وأهل المغفرة
en: And they will not remember except that Allah wills. He is worthy of fear and adequate for [granting] forgiveness.

source: لا أقسم بيوم القيامة
en: I swear by the Day of Resurrection

source: ولا أقسم بالنفس اللوامة
en: And I swear by the reproaching soul [to the certainty of resurrection].

source: أيحسب الإنسان ألن نجمع عظامه
en: Does man think that We will not assemble his bones?

source: بلى قادرين على أن نسوي بنانه
en: Yes. [We are] Able [even] to proportion his fingertips.

source: بل يريد الإنسان ليفجر أمامه
en: But man desires to continue in sin.

source: يسأل أيان يوم القيامة
en: He asks, "When is the Day of Resurrection?"

source: فإذا برق البصر
en: So when vision is dazzled

source: وخسف القمر
en: And the moon darkens

source: وجمع الشمس والقمر
en: And the sun and the moon are joined,

source: يقول الإنسان يومئذ أين المفر
en: Man will say on that Day, "Where is the [place of] escape?"

source: كلا لا وزر
en: No! There is no refuge.

source: إلى ربك يومئذ المستقر
en: To your Lord, that Day, is the [place of] permanence.

source: ينبأ الإنسان يومئذ بما قدم وأخر
en: Man will be informed that Day of what he sent ahead and kept back.

source: بل الإنسان على نفسه بصيرة
en: Rather, man, against himself, will be a witness,

source: ولو ألقى معاذيره
en: Even if he presents his excuses.

source: لا تحرك به لسانك لتعجل به
en: Move not your tongue with it, [O Muhammad], to hasten with recitation of the Qur'an.

source: إن علينا جمعه وقرآنه
en: Indeed, upon Us is its collection [in your heart] and [to make possible] its recitation.

source: فإذا قرأناه فاتبع قرآنه
en: So when We have recited it [through Gabriel], then follow its recitation.

source: ثم إن علينا بيانه
en: Then upon Us is its clarification [to you].

source: كلا بل تحبون العاجلة
en: No! But you love the immediate

source: وتذرون الآخرة
en: And leave the Hereafter.

source: وجوه يومئذ ناضرة
en: [Some] faces, that Day, will be radiant,

source: إلى ربها ناظرة
en: Looking at their Lord.

source: ووجوه يومئذ باسرة
en: And [some] faces, that Day, will be contorted,

source: تظن أن يفعل بها فاقرة
en: Expecting that there will be done to them [something] backbreaking.

source: كلا إذا بلغت التراقي
en: No! When the soul has reached the collar bones

source: وقيل من راق
en: And it is said, "Who will cure [him]?"

source: وظن أنه الفراق
en: And the dying one is certain that it is the [time of] separation

source: والتفت الساق بالساق
en: And the leg is wound about the leg,

source: إلى ربك يومئذ المساق
en: To your Lord, that Day, will be the procession.

source: فلا صدق ولا صلى
en: And the disbeliever had not believed, nor had he prayed.

source: ولكن كذب وتولى
en: But [instead], he denied and turned away.

source: ثم ذهب إلى أهله يتمطى
en: And then he went to his people, swaggering [in pride].

source: أولى لك فأولى
en: Woe to you, and woe!

source: ثم أولى لك فأولى
en: Then woe to you, and woe!

source: أيحسب الإنسان أن يترك سدى
en: Does man think that he will be left neglected?

source: ألم يك نطفة من مني يمنى
en: Had he not been a sperm from semen emitted?

source: ثم كان علقة فخلق فسوى
en: Then he was a clinging clot, and [Allah] created [his form] and proportioned [him]

source: فجعل منه الزوجين الذكر والأنثى
en: And made of him two mates, the male and the female.

source: أليس ذلك بقادر على أن يحيي الموتى
en: Is not that [Creator] Able to give life to the dead?
